"""
一、作业讲解
redirect，重定向函数
location 处如果不指定host，默认使用当前页面的host

二、todo程序
routes_todo.py 包含了项目的所有路由函数：显示所有todo，增加todo，更新todo，删除todo
todo.py 包含所有 Todo Model，用于处理数据
templates/todo_index.html 显示所有 todo 页面
templates/todo_edit.html 显示编辑 todo 页面

/todo/add --> 添加todo的页面 --> todo_index.html
/todo/

新增原理：点击 add 添加新 todo 时，程序流程如下：
    1，浏览器提交一个表单给服务器（POST请求）
    2，服务器解析出表单数据，并且添加一条数据到数据库，并返回302响应
    3，浏览器根据302中的地址，自动发送一条GET请求
    4，服务器给浏览器一个页面响应

修改原理：同样的在触发时得到需要修改的内容，在数据库修改，然后全量返回数据库里的 todo
做一个超链接来作为用户发送数据的网页

验证用户：在数据库里加入一个字段-用户id，来判断todo的归属
只有经过登录验证且id一致才能访问、修改和删除todo

修改：跳转到一个编辑页面，那里的输入框集可以对数据库进行修改，

网页的互动实质上就是数据的修改。
一定要明确：发送什么样的请求？有什么数据，数据什么格式？有什么头？
数据存储在哪里？如何进行读取和存储？

网页是给用户看的，可能有些东西不想给用户看到，可以把它隐藏起来；但是用户也可以通过修改网页看到隐藏内容。因此，严格的校验一定要在服务器端进行。
浏览器端的隐藏只是不想让用户看到，而不是防止用户修改；如果是为了数据安全，一定要在后端校验。


HTTP 头部的内容一定是 ASCII 编码
body 的编码会在头部说明

逻辑删除：注销的账号在数据库里不会被真正的抹去，而是被打上一个删除标记。
"""
