"""
1，摘要算法
用途：防止数据库泄露用户数据
定义：一种能产生特殊输出格式的算法，给定任意长度的数据生成定长的密文；摘要的结果是不可逆的，不能被还原为原数据；理论上无法通过反向运算取得原数据内容。并且，一个安全的摘要算法是无法找到碰撞（两个不一样的数据，产生一样的结果）。通常被用来验证数据完整性，或者用来加密用户密码。
例子：md5 和 sha1；md5 的输出结果为 32 字符；sha1 的输出结果为 40 字符

任意数据 - 摘要算法 - 生成摘要

2，用 md5 或者 sha1 保护用户的密码
用户的密码存在数据库中，可能会被黑客盗取
所以一般会对用户的密码使用摘要算法加密
存储在数据库中的是加密后的密文（所以找回密码是不可能的，只能重置，因为摘要不可逆）

用户注册 - 输入密码 - 数据库保存摘要 - 登录验证摘要 - 摘要符合 - 登录成功

3，破解方法
暴力破解：用常见密码库，依次生成 hash 结果，然后挨个比对。鉴于计算机的运行速度，所以简单的密码仍然有可能被破解

4，加盐
加入用户使用简单密码，我们可以给密码存储一个额外信息，扰乱用户的简单密码
比如：原始密码'123'，加盐(salt)'sahiuw123'，变成'sahiuw123123'
这样黑客暴力破解出'sahiuw123123'，也无法还原出用户的密码

5，重置密码功能
会往邮箱发邮件，邮件里面的参数是独一无二的。（我们认为邮箱的拥有者拥有改密码的权限）

使用 uuid 生成 随机字符串

必备知识：from . import,“.”  代表使用相对路径导入，即从当前项目中寻找需要导入的包或函数
"""
