"""
网址的组成部分(四部分)
协议    http, https
主机    g.cn, zhihu.com
端口    http默认80，https默认443，因此一般不用填写
路径    下面的"/"和"/question/31838184"都是路径
http://www.zhihu.com/
http://www.zhihu.com/question/31838184
http://www.zhuhu.com:80/
实际数网址都是字符串，只是规定把它分割成了几部分
所以后面的很多内容就是拼接和拆分字符串
"""

"""
域名和IP
电脑靠IP地址通信，IP地址记不住就发明了域名(domain name)，然后电脑自动向DNS服务器(domain name server)查询域名对应的IP地址。
"""

"""
端口
比喻：以写信来打比方。IP是地址，端口是收信人的姓名。因为在同一台电脑上有若干应用在使用网络，所以需要使用端口来区分是哪个程序使用的。
端口是一个16位的数字（2**16）
"""

"""
HTTP协议
协议就是双方都遵守的规范
HTTP协议是为了维持文本信息的可读性，产生的协议。
这样通信双方(服务器和浏览器)就知道对方发过来的文本内容是什么。其他人也知道信息是发给谁。
1.浏览器发送请求到服务器
2.服务器解析请求，返回文本数据到浏览器
3.浏览器解析收到的数据并处理

请求和返回是一样的数据格式，分为4部分：
1.请求行或者响应行
2.Header(请求的Header中的Host是必须字段，其他都是可选的)
3.\r\n\r\n(连续两个换行回车符，用来分隔Header和Body)
4.Body(可选)

请求格式如下：
'GET / HTTP/1.1\r\nhost:g.cn\r\n\r\n'
GET：方法
/：路径("/"表示跟路径)(也可以在这里输入全部的地址，host不填)
HTTP/1.1：网络协议版本
host：主机地址

返回的数据如下：
'HTTP/1.1 301 Moved Permanetly
Body XXX'
HTTP/1.1：网络协议版本
301：状态码
Moved Permanetly：对状态码的描述(这里是你访问的地址已经永久移动，然后返回了一个新的地址)

Web服务器做什么：
解析请求，发送相应的数据给客户端
"""

"""
整个通信的流程
1.创建一个socket对象
2.通过socket对象，告诉电脑，我要和xxx(host)通信(这里是否就是三次握手？)
3.发送通信的内容(这里通信的内容是一个变量，可以自定义，只需要符合 http 协议即可)
4.接受响应数据
"""
